csm7/nRF52Service/Src/nRF52Service_v2.c
/**
 * Copyright (c) 2014 - 2020, Nordic Semiconductor ASA
 */
/** @file
 *
 * @defgroup ble_sdk_app_template_main main.c
 * @{
 * @ingroup ble_sdk_app_template
 * @brief Template project main file.
 *
 * This file contains a template for creating a new application. It has the code necessary to wakeup
 * from button, advertise, get a connection restart advertising on disconnect and if no new
 * connection created go back to system-off mode.
 * It can easily be used as a starting point for creating a new application, the comments identified
 * with 'YOUR_JOB' indicates where and how you can customize.
 */

#include "nRF52Service_v2.h"

NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

 /**< Context for the Queued Write module.*/
BLE_CUS_DEF(m_cus);
BLE_CUS_DEF(m_acel_cus);
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */

/*Temperature timer*/
APP_TIMER_DEF(m_ecelerometr_timer_id);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
	app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
	pm_handler_on_pm_evt(p_evt);
	pm_handler_flash_clean(p_evt);

	switch (p_evt->evt_id)
	{
	case PM_EVT_PEERS_DELETE_SUCCEEDED:
		advertising_start(false);
		break;

	default:
		break;
	}
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *
 * @param[in] p_context  Pointer used for passing some arbitrary information (context) from the
 *                       app_start_timer() call to the timeout handler.
 */
static void acelerometr_level_meas_timeout_handler(void* p_context)
{
	ret_code_t err_code;
	uint8_t  encoded_temperature[4];
	int32_t  raw_temperature = 0;     // signed 32 bit
	int8_t   temperature = 0;     // signed 8 bit

	UNUSED_PARAMETER(p_context);

	BMA280_Get_Data(resultBMA);

	NRF_LOG_INFO("Battery Level timeout event");

	sd_temp_get(&raw_temperature);
	// temperature is in 0.25C° units. watch out for negative values!
	temperature = raw_temperature / 4;
	uint32_encode(raw_temperature, encoded_temperature);

	// Only send the battery level update if we are connected
	if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
	{
		bsp_board_led_invert(BSP_LED_INDICATE_USER_LED2);

		err_code = temperature_value_update(&m_cus, encoded_temperature, sizeof(encoded_temperature));
		APP_ERROR_CHECK(err_code);
	}
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
	// Initialize timer module.
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);

	// Create timers.

	err_code = app_timer_create(&m_ecelerometr_timer_id, 
		APP_TIMER_MODE_REPEATED, 
		acelerometr_level_meas_timeout_handler);

	APP_ERROR_CHECK(err_code);

	/* YOUR_JOB: Create any timers to be used by the application.
	             Below is an example of how to create a timer.
	             For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
	             one.
	      ret_code_t err_code;
	      err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
	      APP_ERROR_CHECK(err_code); */
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
	ret_code_t              err_code;
	ble_gap_conn_params_t   gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
		(const uint8_t *)DEVICE_NAME,
		strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	/* YOUR_JOB: Use an appearance value matching the application's use case.
	   err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
	   APP_ERROR_CHECK(err_code); */

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency     = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
	ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}

/** @ brief Function for handling the commands on the Neopixel controller service ..
 *
 * @ param[in]   commands   Array of data sent by the Neocontroller mobile app to update the Neopixel state.
 * @ param[in]   lenght     The lenght of that array in bytes.
 */
static void command_handler(uint8_t const * commands, uint16_t  lenght)
{
	ret_code_t   err_code;

#if UART_PRINTING_ENABLED
	for (uint8_t i = 0; i < lenght; i++)
	{
		NRF_LOG_INFO("commands[%d] = %d;", i, commands[i]);
	}  
#endif

	// you can excute functions based on the command you receive here.
}

/**@brief Function for handling the Neocontroller Service events.
 *
 * @details This function will be called for all Custom Service ble events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service   Csutom Service structure.
 * @param[in]   p_evt           Event received from the Custom Service.
 *
 */
static void on_cus_evt(ble_cus_t  * p_cus_service, ble_cus_evt_t * p_evt)
{
	ret_code_t   err_code;

	switch (p_evt->evt_type)
	{
	case BLE_CUS_EVT_CONNECTED:
		break;

	case BLE_CUS_EVT_DISCONNECTED:
		break;

	case BLE_CUS_EVT_COMMAND_RX:
#if UART_PRINTING_ENABLED
		NRF_LOG_INFO("command rerceived!");
#endif
		command_handler(p_evt->params_command.command_data.p_data, p_evt->params_command.command_data.length);
		break;

	default:
		// No implementation needed.
	 break;
	}
}


