csm7/nRF52Service/Src/nRF52Service_v2.c
/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/

/**@brief Function for initializing the Custom controller service.
 */
static void cus_service_init(void) {

	ret_code_t          err_code;
	ble_cus_init_t      cus_init = { 0 };


	// temperature notification cccd write permission
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.temperature_char_attr_md.cccd_write_perm);
 
	// temperature char write&read opeartion permetted
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.temperature_char_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&cus_init.temperature_char_attr_md.write_perm);

	// command characteristic write and read opeartions permissions
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&cus_init.command_char_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.command_char_attr_md.write_perm);

	// service event handler
	cus_init.evt_handler        = on_cus_evt; 
	// service init
//	err_code = ble_cus_init(&m_cus, &cus_init);
//	APP_ERROR_CHECK(err_code);

	ble_cus_init_t			acel_init = { 0 };

	// temperature notification cccd write permission
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&acel_init.temperature_char_attr_md.cccd_write_perm);
 
	// temperature char write&read opeartion permetted
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&acel_init.temperature_char_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&acel_init.temperature_char_attr_md.write_perm);

	// command characteristic write and read opeartions permissions
	BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&acel_init.command_char_attr_md.read_perm);
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&acel_init.command_char_attr_md.write_perm);

	// service event handler
	acel_init.evt_handler        = on_cus_evt; 
	// service init
	err_code = ble_cus_init(&m_cus, &m_acel_cus, &acel_init, &acel_init);
	APP_ERROR_CHECK(err_code);
	
} 


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	ret_code_t         err_code;
	nrf_ble_qwr_init_t qwr_init = { 0 };

	// Initialize Queued Write Module.
	qwr_init.error_handler = nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	cus_service_init();

//	ble_cus_init_t acelX_init;
//	ble_cus_init_t acelY_init;
//
//	memset(&acelX_init, 0, sizeof(acelX_init));
//
//	acelX_init.evt_handler = NULL;
//	
//	ble_advertising_init_t acelZ_init;
//
//	acelZ_init.evt_handler = NULL;
//
//	err_code = ble_advertising_init(&m_)

	/* YOUR_JOB: Add code to initialize the services used by the application.
	   ble_xxs_init_t                     xxs_init;
	   ble_yys_init_t                     yys_init;

	   // Initialize XXX Service.
	   memset(&xxs_init, 0, sizeof(xxs_init));

	   xxs_init.evt_handler                = NULL;
	   xxs_init.is_xxx_notify_supported    = true;
	   xxs_init.ble_xx_initial_value.level = 100;

	   err_code = ble_bas_init(&m_xxs, &xxs_init);
	   APP_ERROR_CHECK(err_code);

	   // Initialize YYY Service.
	   memset(&yys_init, 0, sizeof(yys_init));
	   yys_init.evt_handler                  = on_yys_evt;
	   yys_init.ble_yy_initial_value.counter = 0;

	   err_code = ble_yy_service_init(&yys_init, &yy_init);
	   APP_ERROR_CHECK(err_code);
	 */
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
	ret_code_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
	{
		err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
	ret_code_t             err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params                  = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail             = false;
	cp_init.evt_handler                    = on_conn_params_evt;
	cp_init.error_handler                  = conn_params_error_handler;

	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
	ret_code_t err_code;

	err_code = bsp_indication_set(BSP_INDICATE_IDLE);
	APP_ERROR_CHECK(err_code);

