csm7/nRF52Service/Src/nRF52Service_v2.c
	err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	if (err_code != NRF_ERROR_INVALID_STATE)
	{
		APP_ERROR_CHECK(err_code);
	}
}

/**@brief Function for restarting the advertising without the whitelist.
*/
static void adv_restart_without_whitelist()
{
	ret_code_t  err_code;

	if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
	{
		err_code = ble_advertising_restart_without_whitelist(&m_advertising);
		if (err_code != NRF_ERROR_INVALID_STATE)
		{
			APP_ERROR_CHECK(err_code);
		}
	}
}


///**@brief Function for initializing buttons and leds.
// *
// * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
// */
//static void buttons_leds_init(bool * p_erase_bonds)
//{
//    ret_code_t err_code;
//    bsp_event_t startup_event;
//
//    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
//    APP_ERROR_CHECK(err_code);
//
//    err_code = bsp_btn_ble_init(NULL, &startup_event);
//    APP_ERROR_CHECK(err_code);
//
//    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
//}

/**@brief Function for handeling the buttons events.
*
*/
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
	ret_code_t err_code;
	uint8_t  encoded_temperature[4];
	int32_t  raw_temperature = 0;     // signed 32 bit
	int8_t   temperature = 0;     // signed 8 bit

	switch(pin_no)
	{
	case BUTTON_1:
		if (button_action == APP_BUTTON_PUSH) 
		{           
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button1 pressed.");
#endif

			sd_temp_get(&raw_temperature);
			// temperature is in 0.25C° units. watch out for negative values!
			temperature = raw_temperature / 4;
			uint32_encode(raw_temperature, encoded_temperature);
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("temperature = %d.", temperature);
			for (uint8_t i = 0; i < 4;i++)
			{
				NRF_LOG_INFO("encoded_temperature[%d] = %d.", i, encoded_temperature[i]);
			}
#endif
			if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
			{
				err_code = temperature_value_update(&m_cus, encoded_temperature, sizeof(encoded_temperature));
				APP_ERROR_CHECK(err_code);
			}
			else 
			{
#ifdef UART_PRINTING_ENABLED
				NRF_LOG_INFO("Ooops, you are not connected!");
#endif
			}

		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button1 released.");
#endif
		}
		break;

	case BUTTON_2:
		if (button_action == APP_BUTTON_PUSH) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button2 pressed.");
#endif
		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button2 released.");
#endif
		}
		break;

	case BUTTON_3:
		if (button_action == APP_BUTTON_PUSH) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button3 pressed.");
#endif
		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button3 released.");
#endif
		}
		break;

	case BUTTON_4:
		if (button_action == APP_BUTTON_PUSH) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button4 pressed.");
#endif
		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button4 released.");
#endif
		}
		break;
		// you can define the folowing buttons in the components/boards/pca10056.h file.
#ifdef BUTTON_5
		   case BUTTON_5 :
		     if(button_action == APP_BUTTON_PUSH) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button5 pressed.");
#endif
		}
		else if(button_action == APP_BUTTON_RELEASE) 
		{
			sleep_mode_enter();
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button5 released.");
#endif
		}
		break;
#endif
#ifdef BUTTON_6
	case BUTTON_6:
		if (button_action == APP_BUTTON_PUSH) 
		{
			disconnect();
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button6 pressed.");
#endif
		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button6 released.");
#endif
		}
		break;
#endif
#ifdef BUTTON_7
	case BUTTON_7:
		if (button_action == APP_BUTTON_PUSH) 
		{
			adv_restart_without_whitelist();
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button7 pressed.");
#endif
		}
		else if (button_action == APP_BUTTON_RELEASE) 
		{
#ifdef UART_PRINTING_ENABLED
			NRF_LOG_INFO("button7 released.");
#endif
		}
		break;
#endif
	default:
		return; // no implementation needed
	}

}


/**@brief Function for buttons configuration.
 *
 */
static const app_button_cfg_t app_buttons[BUTTONS_NUMBER] = 
{
	{ BUTTON_1, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler },
	{ BUTTON_2, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler },
	{ BUTTON_3, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler },
	{ BUTTON_4, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler }
#ifdef BUTTON_5
	 { BUTTON_5, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler },
#endif
#ifdef BUTTON_6
	{ BUTTON_6, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler },
#endif
#ifdef BUTTON_7
	{ BUTTON_7, BUTTONS_ACTIVE_STATE, BUTTON_PULL, button_event_handler }
#endif 
}; 

/**@brief Function for initializing buttons.
*
* @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
*/
void buttons_init(bool * p_erase_bonds)
{
	ret_code_t  err_code;
	bsp_event_t startup_event;
#define BUTTON_DETECTION_TIME 10

	err_code = app_button_init((app_button_cfg_t *)app_buttons, BUTTONS_NUMBER, BUTTON_DETECTION_TIME);
	APP_ERROR_CHECK(err_code);

	err_code = app_button_enable();
	APP_ERROR_CHECK(err_code);

	err_code = bsp_btn_ble_init(NULL, &startup_event);
	APP_ERROR_CHECK(err_code);

	*p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);

}

/**@brief Function for initializing the leds with the bsp library.
 *
 */
static void leds_init()
{
	ret_code_t err_code;

	err_code = bsp_init(BSP_INIT_LEDS, NULL);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
	ret_code_t err_code = NRF_LOG_INIT(NULL);
	APP_ERROR_CHECK(err_code);

	NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
	ret_code_t err_code;
	err_code = nrf_pwr_mgmt_init();
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
	if (NRF_LOG_PROCESS() == false)
	{
		nrf_pwr_mgmt_run();
	}
}


/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
	if (erase_bonds == true)
	{
		delete_bonds();
		// Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
	}
	else
	{
		ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

		APP_ERROR_CHECK(err_code);
	}
}


/**@brief Function for application main entry.
 */
int main(void)
{
	bool erase_bonds;

	// Initialize.
	log_init();
	timers_init();
	buttons_init(&erase_bonds);
	leds_init();
	//    buttons_leds_init(&erase_bonds);
	    power_management_init();
	ble_stack_init();
	gap_params_init();
	gatt_init();
	services_init();
	advertising_init();
	conn_params_init();
	peer_manager_init();
 
 // I2C Init
// 	I2C_init();
	nrf_delay_ms(500);
	// BMA280 init
//	BMA280_Turn_On_Fast();
		nrf_delay_ms(500);
//			BMA280_Calibrate();
				nrf_delay_ms(500);

	// Start execution.
	NRF_LOG_INFO("Template example started.");
//	application_timers_start();

	advertising_start(erase_bonds);

	// Enter main loop.
	for(;  ;)
	{
		idle_state_handle();
	}
}


/**
 * @}
 */
